<?php
	require_once('./db.php');
	/*
	 * @Author
	 * Author: 안윤근
	 * 
	 * @Description
	 * DB에 편하게 집어넣기 위해 임시로 만든 스크립트입니다.
	 * 원래 매니저페이지에서 엑셀을 파싱해서 집어넣어야 하지만..
	 * 매니저페이지를 만들 시간이 없었기 때문에 임시로 이 스크립트를 사용합니다.
	 * 나중에 매니저페이지 만들게 됬을 때 약간의 수정만으로 사용할 수 있게 만들었습니다.
	 *
	 */

	function inserting($tableName, $datas){
		//테이블 비우기
		deletes($tableName);
		//insert
		foreach($datas as $data){
			insert($tableName, $data);
		}
	}

	//유저 정보
	$users = [
	//	ID		SID		     email PW			 name  master
		[null, 'Admin',	     null, 'Admin',		 '관리자', 1],
		['rpsprpsp','TESTER1','frebern@naver.com',pwd('rlslrlsl'),'테스터1',0],
		['rlslrlsl','TESTER2','frebern@naver.com',pwd('rpsprpsp'),'테스터2',1],
		//안윤근
		[null, '2013043285', null, '2013043285', '안윤근', 0],
		//이학진
		[null, '2010036831', null, '2010036831', '이학진', 0],
		//김진희
		[null, '2009034723', null, '2009034723', '김진희', 0],
		//성다혜
		[null, '2013042895', null, '2013042895', '성다혜', 0],
		//우승연
		[null, '2013043296', null, '2013043296', '우승연', 0],
		//송형석
		[null, '2011037161', null, '2011037161', '송형석', 0],
		//김형락
		[null, '2016113819', null, '2016113819', '김형락', 0],
		//김선웅
		[null, '2015123555', null, '2015123555', '김선웅', 0],
		//오지강
		[null, '2015151786', null, '2015151786', 'Wu Zhiqiang', 0]
	];

	//강의스케쥴 정보
	$schedules = [
	//	lectureID	dayofweek	startTime	endTime	classroom
		//안윤근
		['ELE3026', 1, '13:00:00', '14:30:00', 'Y005-0305'],
		['CSE4006', 2, '11:00:00', '12:30:00', 'Y005-0305'],
		['GEN4051', 3, '15:30:00', '17:30:00', 'Y015-0301'],
		['ELE3026', 5, '10:30:00', '12:00:00', 'Y005-0304'],
		['CSE4006', 5, '13:00:00', '15:00:00', 'Y021-0318'],
		['CSE4006', 5, '15:00:00', '16:30:00', 'Y005-0305'],
		//이학진
		['MAT2009', 2, '09:00:00', '10:30:00', 'Y005-0407'],
		['MAT2009', 3, '15:00:00', '16:30:00', 'Y005-0503'],
		//김진희
		['ECC3005', 1, '13:00:00', '14:30:00', 'Y005-0407'],
		['ECC3004', 1, '14:30:00', '16:00:00', 'Y005-0401'],
		['ECE4065', 1, '16:00:00', '17:30:00', 'Y005-0401'],
		['EIS1003', 2, '13:00:00', '14:30:00', 'Y005-0401'],
		['ECE4065', 3, '10:30:00', '12:00:00', 'Y005-0303'],
		['ECC3004', 3, '15:00:00', '16:30:00', 'Y005-0505'],
		['ECC3005', 3, '16:30:00', '18:00:00', 'Y005-0407'],
		['EIS1003', 4, '14:30:00', '16:00:00', 'Y005-0501'],
		//성다혜
		['GEN3064', 3, '15:30:00', '17:30:00', 'Y015-0301'],
		['ELE3026', 5, '10:30:00', '12:00:00', 'Y005-0304'],
		//우승연
		['CSE4076', 1, '9:00:00', '10:30:00', 'Y005-0305'],
		['CSE4076', 2, '9:00:00', '10:30:00', 'Y005-0509'],
		//송형석
		['ITE4067', 3, '10:00:00', '12:00:00', 'Y022-0412'],
		['ITE4067', 3, '15:00:00', '17:00:00', 'Y022-0412'],
		['CLU1066', 4, '16:00:00', '18:00:00', 'Y048-0304'],
		//김형락
		['CSE9099', 1, '09:00:00', '12:00:00', 'Y005-0405'],
		['CSE8043', 2, '16:00:00', '19:00:00', 'Y005-0405'],
		//김선웅
		['CSE8069', 2, '13:00:00', '16:00:00', 'Y005-0405'],
		['CSE8046', 4, '09:30:00', '12:30:00', 'Y022-0412']
		//오지강
	];

	//강의 정보
	$lectures = [
	//	lectureID	lectureName	Professor
		//안윤근
		['ELE3026', '객체지향개발론', '김정선'],
		['CSE4006', '소프트웨어공학', 'Scott Uk-Jin Lee'],
		['GEN4051', '초우량기업의조건', '전상길'],
		//이학진
		['CYB9001', '사이버토익', '이다미'],
		['MAT2009', '미분방정식', '마상백'],
		//김진희
		['ECC3005', '고급전자물리', '심종인'],
		['ECC3004', '불규칙변수론', '김동우'],
		['ECE4065', '컴퓨터네트워크1', '김동우'],
		['EIS1003', '제어시스템공학', '송택렬'],
		//성다혜
		['GEN3064', '고급컴퓨터활용', '최기환'],
		//우승연
		['CSE4076', '정보검색론','김영훈'],
		//송형석
		['CLU1066', '특허와협상', '송지성'],
		['ITE4067', '임베디드소프트웨어설계', '윤종원'],
		//김형락
		['CSE9099', '소프트웨어구조특강', '김정선'],
		['CSE8043', '알고리즘해석', '오희국'],
		//김선웅
		['ECC3005', '암호학', '마상백'],
		['ECC3004', '하드웨어특강', '박성주']
		//오지강
	];

	//아이디와 듣는강의 연결
	$connections = [
	//	SID		lectureID
		//안윤근
		['2013043285', 'ELE3026'],
		['2013043285', 'CSE4006'],
		['2013043285', 'GEN4051'],
		//이학진
		['2010036831', 'ELE3026'],
		['2010036831', 'CSE4006'],
		['2010036831', 'MAT4006'],
		['2010036831', 'CYB9001'],
		//김진희
		['2009034723', 'ECC3005'],
		['2009034723', 'ECC3004'],
		['2009034723', 'ECE4065'],
		['2009034723', 'CSE4006'],
		['2009034723', 'EIS1003'],
		//성다혜
		['2013042895', 'ELE3026'],
		['2013042895', 'CSE4006'],
		['2013042895', 'GEN3064'],
		//우승연
		['2013043296', 'CSE4006'],
		['2013043296', 'ELE3026'],
		['2013043296', 'CSE4076'],
		//송형석
		['2011037161', 'CLU1066'],
		['2011037161', 'CYB9001'],
		['2011037161', 'CSE4006'],
		['2011037161', 'ITE4067'],
		//김형락
		['2016113819', 'CSE9099'],
		['2016113819', 'CSE8043'],
		['2016113819', 'CSE4006'],
		//김선웅
		['2015123555', 'CSE8069'],
		['2015123555', 'CSE4006'],
		['2015123555', 'CSE8046'],
		//오지강
		['2015151786', 'CSE8069'],
		['2015151786', 'CSE4006'],
		['2015151786', 'CSE8046']
	];

	
	$dataSet = array('User'=>$users, 'LectureSchedule'=>$schedules, 'Lecture'=>$lectures, 'ConnectLecture'=>$connections);
	foreach($dataSet as $table=>$datas){
		inserting($table,$datas);
	}

	//OTP 테이블 비우기.
	deletes('OTP');

	//확인하기
	echo 'Done!';

?>